# Тузов Даниил ИУ7-12Б
# Программа для определения в какой части графика находится точка

while True:
    x, y = float(input("Введите X координату: ")), float(input("Введите Y координату: "))

    is1 = y <= -1/8 *(x + 9) ** 2 + 8
    is2 = y <= -1/8 *(x - 9) ** 2 + 8
    is3 = y <= 7 * (x + 8) ** 2 + 1
    is4 = y <= 7 * (x - 8) ** 2 + 1
    is5 = y <= 1/49 * (x + 1) ** 2
    is6 = y <= 1/49 * (x - 1) ** 2
    is7 = y <= -4 * x ** 2 + 2
    is8 = y <= 4 * x ** 2 - 6
    is9 = y <= -4/49 * (x + 1) ** 2
    is10 = y <= -4/49 * (x - 1) ** 2
    is11 = y <= 1/3*(x + 5) ** 2 - 7
    is12 = y <= 1/3*(x - 5) ** 2 - 7
    is13 = y <= -2 * (x + 1) ** 2 - 2
    is14 = y <= -2 * (x - 1) ** 2 - 2
    is15 = y == 3/2*abs(x) + 2

    if is15:
        print("Точка на рожках бабочки")
    elif is1 and not is5 and -8 <= x <= -1 or not is3 and is1 and -9 <= x <= -8:
        print("Точка в верхней части левого крыла")
    elif is2 and not is6 and 1 <= x <= 8 or not is4 and is2 and 8 <= x <= 9:
        print("Точка в верхней части правого крыла")
    elif is7 and not is8:
        print("Точка в теле бабочки")
    elif is9 and not is11 and not is13:
        print("Точка лежит в нижней части левого крыла")
    elif is10 and not is12 and not is14:
        print("Точка лежит в нижней части правого крыла")
    else:
        print("Точка не лежит на бабочке")